1) /Users/guillaume/Projects/edgedb-php/src/Protocol/Credentials.php:68    [M] LessThan

--- Original
+++ New
@@ @@
     private function validateCredentials(array $credentials = []) : array
     {
         $credentials['port'] = $credentials['port'] ?? 5656;
-        if (!is_int($credentials['port']) || ($credentials['port'] < 1 || $credentials['port'] > 65535)) {
+        if (!is_int($credentials['port']) || ($credentials['port'] <= 1 || $credentials['port'] > 65535)) {
             throw new RuntimeException('The port is not valid');
         }
         if (array_key_exists('host', $credentials) && !is_string($credentials['host'])) {

2) /Users/guillaume/Projects/edgedb-php/src/Protocol/Credentials.php:68    [M] GreaterThan

--- Original
+++ New
@@ @@
     private function validateCredentials(array $credentials = []) : array
     {
         $credentials['port'] = $credentials['port'] ?? 5656;
-        if (!is_int($credentials['port']) || ($credentials['port'] < 1 || $credentials['port'] > 65535)) {
+        if (!is_int($credentials['port']) || ($credentials['port'] < 1 || $credentials['port'] >= 65535)) {
             throw new RuntimeException('The port is not valid');
         }
         if (array_key_exists('host', $credentials) && !is_string($credentials['host'])) {

3) /Users/guillaume/Projects/edgedb-php/src/Protocol/Credentials.php:72    [M] LogicalNot

--- Original
+++ New
@@ @@
         if (!is_int($credentials['port']) || ($credentials['port'] < 1 || $credentials['port'] > 65535)) {
             throw new RuntimeException('The port is not valid');
         }
-        if (array_key_exists('host', $credentials) && !is_string($credentials['host'])) {
+        if (array_key_exists('host', $credentials) && is_string($credentials['host'])) {
             throw new RuntimeException('The host is not valid');
         }
         if (array_key_exists('database', $credentials) && !is_string($credentials['database'])) {

4) /Users/guillaume/Projects/edgedb-php/src/Protocol/Credentials.php:80    [M] LogicalNot

--- Original
+++ New
@@ @@
         if (array_key_exists('database', $credentials) && !is_string($credentials['database'])) {
             throw new RuntimeException('The database is not valid');
         }
-        if (array_key_exists('user', $credentials) && !is_string($credentials['user'])) {
+        if (array_key_exists('user', $credentials) && is_string($credentials['user'])) {
             throw new RuntimeException('The user is not valid');
         }
         if (array_key_exists('password', $credentials) && !is_string($credentials['password'])) {

5) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteBuffer.php:19    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function __construct()
     {
         $this->buffer = new Buffer();
-        $this->size = 4096;
+        $this->size = 4095;
         $this->position = 0;
     }
     public function reset() : void

6) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteBuffer.php:19    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function __construct()
     {
         $this->buffer = new Buffer();
-        $this->size = 4096;
+        $this->size = 4097;
         $this->position = 0;
     }
     public function reset() : void

Timed Out mutants:
==================

Not Covered mutants:
====================

1) /Users/guillaume/Projects/edgedb-php/src/EdgeQLHttpClient.php:55    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->eventDispatcher = $eventDispatcher;
         $this->logger = $logger ?: new NullLogger();
     }
-    public function post(string $query, array $variables = []) : EdgeQLHttpResult
+    protected function post(string $query, array $variables = []) : EdgeQLHttpResult
     {
         return $this->sendRequest(function () use($query, $variables) : RequestInterface {
             $request = $this->requestFactory->createRequest('POST', $this->endpoint)->withHeader('Content-Type', 'application/json')->withHeader('Accept', 'application/json')->withBody($this->streamFactory->createStream(json_encode(['query' => $query])));

2) /Users/guillaume/Projects/edgedb-php/src/EdgeQLHttpClient.php:61    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function post(string $query, array $variables = []) : EdgeQLHttpResult
     {
         return $this->sendRequest(function () use($query, $variables) : RequestInterface {
-            $request = $this->requestFactory->createRequest('POST', $this->endpoint)->withHeader('Content-Type', 'application/json')->withHeader('Accept', 'application/json')->withBody($this->streamFactory->createStream(json_encode(['query' => $query])));
+            $request = $this->requestFactory->createRequest('POST', $this->endpoint)->withHeader('Content-Type', 'application/json')->withHeader('Accept', 'application/json')->withBody($this->streamFactory->createStream(json_encode([])));
             if ([] !== $variables) {
                 $request = $request->withBody($this->streamFactory->createStream(json_encode(['query' => $query, 'variables' => json_encode($variables)])));
             }

3) /Users/guillaume/Projects/edgedb-php/src/EdgeQLHttpClient.php:66    [M] NotIdentical

--- Original
+++ New
@@ @@
     {
         return $this->sendRequest(function () use($query, $variables) : RequestInterface {
             $request = $this->requestFactory->createRequest('POST', $this->endpoint)->withHeader('Content-Type', 'application/json')->withHeader('Accept', 'application/json')->withBody($this->streamFactory->createStream(json_encode(['query' => $query])));
-            if ([] !== $variables) {
+            if ([] === $variables) {
                 $request = $request->withBody($this->streamFactory->createStream(json_encode(['query' => $query, 'variables' => json_encode($variables)])));
             }
             return $request;

4) /Users/guillaume/Projects/edgedb-php/src/EdgeQLHttpClient.php:67    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         return $this->sendRequest(function () use($query, $variables) : RequestInterface {
             $request = $this->requestFactory->createRequest('POST', $this->endpoint)->withHeader('Content-Type', 'application/json')->withHeader('Accept', 'application/json')->withBody($this->streamFactory->createStream(json_encode(['query' => $query])));
             if ([] !== $variables) {
-                $request = $request->withBody($this->streamFactory->createStream(json_encode(['query' => $query, 'variables' => json_encode($variables)])));
+                $request = $request->withBody($this->streamFactory->createStream(json_encode(['variables' => json_encode($variables)])));
             }
             return $request;
         }, $query, $variables);

5) /Users/guillaume/Projects/edgedb-php/src/EdgeQLHttpClient.php:69    [M] ArrayItem

--- Original
+++ New
@@ @@
         return $this->sendRequest(function () use($query, $variables) : RequestInterface {
             $request = $this->requestFactory->createRequest('POST', $this->endpoint)->withHeader('Content-Type', 'application/json')->withHeader('Accept', 'application/json')->withBody($this->streamFactory->createStream(json_encode(['query' => $query])));
             if ([] !== $variables) {
-                $request = $request->withBody($this->streamFactory->createStream(json_encode(['query' => $query, 'variables' => json_encode($variables)])));
+                $request = $request->withBody($this->streamFactory->createStream(json_encode(['query' => $query, 'variables' > json_encode($variables)])));
             }
             return $request;
         }, $query, $variables);

6) /Users/guillaume/Projects/edgedb-php/src/EdgeQLHttpClient.php:77    [M] PublicVisibility

--- Original
+++ New
@@ @@
             return $request;
         }, $query, $variables);
     }
-    public function get(string $query, array $variables = []) : EdgeQLHttpResult
+    protected function get(string $query, array $variables = []) : EdgeQLHttpResult
     {
         return $this->sendRequest(function () use($query, $variables) : RequestInterface {
             $request = $this->requestFactory->createRequest('GET', $this->endpoint)->withHeader('Accept', 'application/json');

7) /Users/guillaume/Projects/edgedb-php/src/EdgeQLHttpClient.php:84    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         return $this->sendRequest(function () use($query, $variables) : RequestInterface {
             $request = $this->requestFactory->createRequest('GET', $this->endpoint)->withHeader('Accept', 'application/json');
-            $request->getUri()->withQuery(sprintf('?query=%s', $query));
+            
             if ([] !== $variables) {
                 $request = $request->getUri()->withQuery(sprintf('&variables=%s', json_encode($variables)));
             }

8) /Users/guillaume/Projects/edgedb-php/src/EdgeQLHttpClient.php:86    [M] NotIdentical

--- Original
+++ New
@@ @@
         return $this->sendRequest(function () use($query, $variables) : RequestInterface {
             $request = $this->requestFactory->createRequest('GET', $this->endpoint)->withHeader('Accept', 'application/json');
             $request->getUri()->withQuery(sprintf('?query=%s', $query));
-            if ([] !== $variables) {
+            if ([] === $variables) {
                 $request = $request->getUri()->withQuery(sprintf('&variables=%s', json_encode($variables)));
             }
             return $request;

9) /Users/guillaume/Projects/edgedb-php/src/EdgeQLHttpClient.php:99    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         try {
             $response = $this->client->sendRequest($requestClosure());
-            $this->dispatch(new EdgeQLClientQueryEvent($method, $query, $variables));
+            
         } catch (Throwable $exception) {
             $this->logger->critical('An error occurred when trying to send the request', ['query' => $query, 'variables' => $variables, 'error' => $exception->getMessage()]);
             throw $exception;

10) /Users/guillaume/Projects/edgedb-php/src/EdgeQLHttpClient.php:101    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $response = $this->client->sendRequest($requestClosure());
             $this->dispatch(new EdgeQLClientQueryEvent($method, $query, $variables));
         } catch (Throwable $exception) {
-            $this->logger->critical('An error occurred when trying to send the request', ['query' => $query, 'variables' => $variables, 'error' => $exception->getMessage()]);
+            
             throw $exception;
         }
         $this->logger->info('A query has succeed', ['query' => $query, 'variables' => $variables, 'method' => $method]);

11) /Users/guillaume/Projects/edgedb-php/src/EdgeQLHttpClient.php:101    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $response = $this->client->sendRequest($requestClosure());
             $this->dispatch(new EdgeQLClientQueryEvent($method, $query, $variables));
         } catch (Throwable $exception) {
-            $this->logger->critical('An error occurred when trying to send the request', ['query' => $query, 'variables' => $variables, 'error' => $exception->getMessage()]);
+            $this->logger->critical('An error occurred when trying to send the request', ['variables' => $variables, 'error' => $exception->getMessage()]);
             throw $exception;
         }
         $this->logger->info('A query has succeed', ['query' => $query, 'variables' => $variables, 'method' => $method]);

12) /Users/guillaume/Projects/edgedb-php/src/EdgeQLHttpClient.php:104    [M] ArrayItem

--- Original
+++ New
@@ @@
             $response = $this->client->sendRequest($requestClosure());
             $this->dispatch(new EdgeQLClientQueryEvent($method, $query, $variables));
         } catch (Throwable $exception) {
-            $this->logger->critical('An error occurred when trying to send the request', ['query' => $query, 'variables' => $variables, 'error' => $exception->getMessage()]);
+            $this->logger->critical('An error occurred when trying to send the request', ['query' => $query, 'variables' => $variables, 'error' > $exception->getMessage()]);
             throw $exception;
         }
         $this->logger->info('A query has succeed', ['query' => $query, 'variables' => $variables, 'method' => $method]);

13) /Users/guillaume/Projects/edgedb-php/src/EdgeQLHttpClient.php:107    [M] Throw_

--- Original
+++ New
@@ @@
             $this->dispatch(new EdgeQLClientQueryEvent($method, $query, $variables));
         } catch (Throwable $exception) {
             $this->logger->critical('An error occurred when trying to send the request', ['query' => $query, 'variables' => $variables, 'error' => $exception->getMessage()]);
-            throw $exception;
+            $exception;
         }
         $this->logger->info('A query has succeed', ['query' => $query, 'variables' => $variables, 'method' => $method]);
         $body = json_decode($response->getBody()->getContents(), true);

14) /Users/guillaume/Projects/edgedb-php/src/EdgeQLHttpClient.php:110    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $this->logger->critical('An error occurred when trying to send the request', ['query' => $query, 'variables' => $variables, 'error' => $exception->getMessage()]);
             throw $exception;
         }
-        $this->logger->info('A query has succeed', ['query' => $query, 'variables' => $variables, 'method' => $method]);
+        $this->logger->info('A query has succeed', ['variables' => $variables, 'method' => $method]);
         $body = json_decode($response->getBody()->getContents(), true);
         if (!is_array($body)) {
             throw new RuntimeException('The response body cannot be parsed');

15) /Users/guillaume/Projects/edgedb-php/src/EdgeQLHttpClient.php:110    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $this->logger->critical('An error occurred when trying to send the request', ['query' => $query, 'variables' => $variables, 'error' => $exception->getMessage()]);
             throw $exception;
         }
-        $this->logger->info('A query has succeed', ['query' => $query, 'variables' => $variables, 'method' => $method]);
+        
         $body = json_decode($response->getBody()->getContents(), true);
         if (!is_array($body)) {
             throw new RuntimeException('The response body cannot be parsed');

16) /Users/guillaume/Projects/edgedb-php/src/EdgeQLHttpClient.php:118    [M] LogicalNot

--- Original
+++ New
@@ @@
         }
         $this->logger->info('A query has succeed', ['query' => $query, 'variables' => $variables, 'method' => $method]);
         $body = json_decode($response->getBody()->getContents(), true);
-        if (!is_array($body)) {
+        if (is_array($body)) {
             throw new RuntimeException('The response body cannot be parsed');
         }
         return new EdgeQLHttpResult($body['data'] ?? [], $body['error'] ?? []);

17) /Users/guillaume/Projects/edgedb-php/src/EdgeQLHttpClient.php:119    [M] Throw_

--- Original
+++ New
@@ @@
         $this->logger->info('A query has succeed', ['query' => $query, 'variables' => $variables, 'method' => $method]);
         $body = json_decode($response->getBody()->getContents(), true);
         if (!is_array($body)) {
-            throw new RuntimeException('The response body cannot be parsed');
+            new RuntimeException('The response body cannot be parsed');
         }
         return new EdgeQLHttpResult($body['data'] ?? [], $body['error'] ?? []);
     }

18) /Users/guillaume/Projects/edgedb-php/src/EdgeQLHttpClient.php:122    [M] Coalesce

--- Original
+++ New
@@ @@
         if (!is_array($body)) {
             throw new RuntimeException('The response body cannot be parsed');
         }
-        return new EdgeQLHttpResult($body['data'] ?? [], $body['error'] ?? []);
+        return new EdgeQLHttpResult([], $body['error'] ?? []);
     }
     private function dispatch(StoppableEventInterface $event) : void
     {

19) /Users/guillaume/Projects/edgedb-php/src/EdgeQLHttpClient.php:122    [M] Coalesce

--- Original
+++ New
@@ @@
         if (!is_array($body)) {
             throw new RuntimeException('The response body cannot be parsed');
         }
-        return new EdgeQLHttpResult($body['data'] ?? [], $body['error'] ?? []);
+        return new EdgeQLHttpResult($body['data'] ?? [], []);
     }
     private function dispatch(StoppableEventInterface $event) : void
     {

20) /Users/guillaume/Projects/edgedb-php/src/EdgeQLHttpClient.php:127    [M] Identical

--- Original
+++ New
@@ @@
     }
     private function dispatch(StoppableEventInterface $event) : void
     {
-        if (null === $this->eventDispatcher) {
+        if (null !== $this->eventDispatcher) {
             return;
         }
         $this->eventDispatcher->dispatch($event);
     }

21) /Users/guillaume/Projects/edgedb-php/src/EdgeQLHttpClient.php:131    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if (null === $this->eventDispatcher) {
             return;
         }
-        $this->eventDispatcher->dispatch($event);
+        
     }
 }

22) /Users/guillaume/Projects/edgedb-php/src/Events/EdgeQLClientQueryEvent.php:30    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->query = $query;
         $this->variables = $variables;
     }
-    public function getMethod() : string
+    protected function getMethod() : string
     {
         return $this->method;
     }

23) /Users/guillaume/Projects/edgedb-php/src/Events/EdgeQLClientQueryEvent.php:35    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->method;
     }
-    public function getQuery() : string
+    protected function getQuery() : string
     {
         return $this->query;
     }

24) /Users/guillaume/Projects/edgedb-php/src/Events/EdgeQLClientQueryEvent.php:43    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return array
      */
-    public function getVariables() : array
+    protected function getVariables() : array
     {
         return $this->variables;
     }

26) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:30    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     private function __construct(string $dsn, array $options = [], LoggerInterface $logger = null)
     {
         $configuration = $this->parseDsn($dsn);
-        $this->handleConfiguration($configuration);
+        
         $this->logger = $logger ?: new NullLogger();
     }
     /**

27) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:40    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public static function connect(string $dsn, array $options = [], LoggerInterface $logger = null) : ClientInterface
     {
         $handShake = new WriteMessageBuffer();
-        $handShake->beginMessage();
+        
         return new self($dsn, $options, $logger);
     }
     /**

28) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:55    [M] Identical

--- Original
+++ New
@@ @@
     }
     private function parseDsn(string $dsn) : array
     {
-        if (false === ($parsedDsn = parse_url($dsn))) {
+        if (false !== ($parsedDsn = parse_url($dsn))) {
             throw new InvalidArgumentException('The given DSN is not valid');
         }
         if (!isset($parsedDsn['scheme'])) {

29) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:55    [M] FalseValue

--- Original
+++ New
@@ @@
     }
     private function parseDsn(string $dsn) : array
     {
-        if (false === ($parsedDsn = parse_url($dsn))) {
+        if (true === ($parsedDsn = parse_url($dsn))) {
             throw new InvalidArgumentException('The given DSN is not valid');
         }
         if (!isset($parsedDsn['scheme'])) {

30) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:56    [M] Throw_

--- Original
+++ New
@@ @@
     private function parseDsn(string $dsn) : array
     {
         if (false === ($parsedDsn = parse_url($dsn))) {
-            throw new InvalidArgumentException('The given DSN is not valid');
+            new InvalidArgumentException('The given DSN is not valid');
         }
         if (!isset($parsedDsn['scheme'])) {
             throw new InvalidArgumentException('The scheme must be equal to "edgedb" or a custom instance name');

31) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:59    [M] LogicalNot

--- Original
+++ New
@@ @@
         if (false === ($parsedDsn = parse_url($dsn))) {
             throw new InvalidArgumentException('The given DSN is not valid');
         }
-        if (!isset($parsedDsn['scheme'])) {
+        if (isset($parsedDsn['scheme'])) {
             throw new InvalidArgumentException('The scheme must be equal to "edgedb" or a custom instance name');
         }
         if (!isset($parsedDsn['host'])) {

32) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:60    [M] Throw_

--- Original
+++ New
@@ @@
             throw new InvalidArgumentException('The given DSN is not valid');
         }
         if (!isset($parsedDsn['scheme'])) {
-            throw new InvalidArgumentException('The scheme must be equal to "edgedb" or a custom instance name');
+            new InvalidArgumentException('The scheme must be equal to "edgedb" or a custom instance name');
         }
         if (!isset($parsedDsn['host'])) {
             throw new InvalidArgumentException('The host must be defined');

33) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:63    [M] LogicalNot

--- Original
+++ New
@@ @@
         if (!isset($parsedDsn['scheme'])) {
             throw new InvalidArgumentException('The scheme must be equal to "edgedb" or a custom instance name');
         }
-        if (!isset($parsedDsn['host'])) {
+        if (isset($parsedDsn['host'])) {
             throw new InvalidArgumentException('The host must be defined');
         }

34) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:64    [M] Throw_

--- Original
+++ New
@@ @@
             throw new InvalidArgumentException('The scheme must be equal to "edgedb" or a custom instance name');
         }
         if (!isset($parsedDsn['host'])) {
-            throw new InvalidArgumentException('The host must be defined');
+            new InvalidArgumentException('The host must be defined');
         }
     }

40) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:80    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     private function handleConfiguration(array $configuration) : void
     {
         $resolver = new OptionsResolver();
-        $resolver->setDefaults(['scheme' => 'edgedb', 'host' => '127.0.0.1', 'port' => 5656, 'user' => 'edgedb', 'password' => null, 'database' => 'edgedb', 'admin' => false, 'timeout' => null]);
+        
         $resolver->setAllowedTypes('scheme', ['string']);
         $resolver->setAllowedTypes('host', ['string']);
         $resolver->setAllowedTypes('port', ['int']);

41) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:80    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     private function handleConfiguration(array $configuration) : void
     {
         $resolver = new OptionsResolver();
-        $resolver->setDefaults(['scheme' => 'edgedb', 'host' => '127.0.0.1', 'port' => 5656, 'user' => 'edgedb', 'password' => null, 'database' => 'edgedb', 'admin' => false, 'timeout' => null]);
+        $resolver->setDefaults(['host' => '127.0.0.1', 'port' => 5656, 'user' => 'edgedb', 'password' => null, 'database' => 'edgedb', 'admin' => false, 'timeout' => null]);
         $resolver->setAllowedTypes('scheme', ['string']);
         $resolver->setAllowedTypes('host', ['string']);
         $resolver->setAllowedTypes('port', ['int']);

42) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:83    [M] DecrementInteger

--- Original
+++ New
@@ @@
     private function handleConfiguration(array $configuration) : void
     {
         $resolver = new OptionsResolver();
-        $resolver->setDefaults(['scheme' => 'edgedb', 'host' => '127.0.0.1', 'port' => 5656, 'user' => 'edgedb', 'password' => null, 'database' => 'edgedb', 'admin' => false, 'timeout' => null]);
+        $resolver->setDefaults(['scheme' => 'edgedb', 'host' => '127.0.0.1', 'port' => 5655, 'user' => 'edgedb', 'password' => null, 'database' => 'edgedb', 'admin' => false, 'timeout' => null]);
         $resolver->setAllowedTypes('scheme', ['string']);
         $resolver->setAllowedTypes('host', ['string']);
         $resolver->setAllowedTypes('port', ['int']);

43) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:83    [M] IncrementInteger

--- Original
+++ New
@@ @@
     private function handleConfiguration(array $configuration) : void
     {
         $resolver = new OptionsResolver();
-        $resolver->setDefaults(['scheme' => 'edgedb', 'host' => '127.0.0.1', 'port' => 5656, 'user' => 'edgedb', 'password' => null, 'database' => 'edgedb', 'admin' => false, 'timeout' => null]);
+        $resolver->setDefaults(['scheme' => 'edgedb', 'host' => '127.0.0.1', 'port' => 5657, 'user' => 'edgedb', 'password' => null, 'database' => 'edgedb', 'admin' => false, 'timeout' => null]);
         $resolver->setAllowedTypes('scheme', ['string']);
         $resolver->setAllowedTypes('host', ['string']);
         $resolver->setAllowedTypes('port', ['int']);

44) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:87    [M] FalseValue

--- Original
+++ New
@@ @@
     private function handleConfiguration(array $configuration) : void
     {
         $resolver = new OptionsResolver();
-        $resolver->setDefaults(['scheme' => 'edgedb', 'host' => '127.0.0.1', 'port' => 5656, 'user' => 'edgedb', 'password' => null, 'database' => 'edgedb', 'admin' => false, 'timeout' => null]);
+        $resolver->setDefaults(['scheme' => 'edgedb', 'host' => '127.0.0.1', 'port' => 5656, 'user' => 'edgedb', 'password' => null, 'database' => 'edgedb', 'admin' => true, 'timeout' => null]);
         $resolver->setAllowedTypes('scheme', ['string']);
         $resolver->setAllowedTypes('host', ['string']);
         $resolver->setAllowedTypes('port', ['int']);

45) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:91    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $resolver = new OptionsResolver();
         $resolver->setDefaults(['scheme' => 'edgedb', 'host' => '127.0.0.1', 'port' => 5656, 'user' => 'edgedb', 'password' => null, 'database' => 'edgedb', 'admin' => false, 'timeout' => null]);
-        $resolver->setAllowedTypes('scheme', ['string']);
+        $resolver->setAllowedTypes('scheme', []);
         $resolver->setAllowedTypes('host', ['string']);
         $resolver->setAllowedTypes('port', ['int']);
         $resolver->setAllowedTypes('user', ['string', 'null']);

46) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:91    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $resolver = new OptionsResolver();
         $resolver->setDefaults(['scheme' => 'edgedb', 'host' => '127.0.0.1', 'port' => 5656, 'user' => 'edgedb', 'password' => null, 'database' => 'edgedb', 'admin' => false, 'timeout' => null]);
-        $resolver->setAllowedTypes('scheme', ['string']);
+        
         $resolver->setAllowedTypes('host', ['string']);
         $resolver->setAllowedTypes('port', ['int']);
         $resolver->setAllowedTypes('user', ['string', 'null']);

47) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:92    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $resolver = new OptionsResolver();
         $resolver->setDefaults(['scheme' => 'edgedb', 'host' => '127.0.0.1', 'port' => 5656, 'user' => 'edgedb', 'password' => null, 'database' => 'edgedb', 'admin' => false, 'timeout' => null]);
         $resolver->setAllowedTypes('scheme', ['string']);
-        $resolver->setAllowedTypes('host', ['string']);
+        
         $resolver->setAllowedTypes('port', ['int']);
         $resolver->setAllowedTypes('user', ['string', 'null']);
         $resolver->setAllowedTypes('password', ['string', 'null']);

48) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:92    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $resolver = new OptionsResolver();
         $resolver->setDefaults(['scheme' => 'edgedb', 'host' => '127.0.0.1', 'port' => 5656, 'user' => 'edgedb', 'password' => null, 'database' => 'edgedb', 'admin' => false, 'timeout' => null]);
         $resolver->setAllowedTypes('scheme', ['string']);
-        $resolver->setAllowedTypes('host', ['string']);
+        $resolver->setAllowedTypes('host', []);
         $resolver->setAllowedTypes('port', ['int']);
         $resolver->setAllowedTypes('user', ['string', 'null']);
         $resolver->setAllowedTypes('password', ['string', 'null']);

49) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:93    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $resolver->setDefaults(['scheme' => 'edgedb', 'host' => '127.0.0.1', 'port' => 5656, 'user' => 'edgedb', 'password' => null, 'database' => 'edgedb', 'admin' => false, 'timeout' => null]);
         $resolver->setAllowedTypes('scheme', ['string']);
         $resolver->setAllowedTypes('host', ['string']);
-        $resolver->setAllowedTypes('port', ['int']);
+        
         $resolver->setAllowedTypes('user', ['string', 'null']);
         $resolver->setAllowedTypes('password', ['string', 'null']);
         $resolver->setAllowedTypes('database', ['string', 'null']);
