50) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:93    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $resolver->setDefaults(['scheme' => 'edgedb', 'host' => '127.0.0.1', 'port' => 5656, 'user' => 'edgedb', 'password' => null, 'database' => 'edgedb', 'admin' => false, 'timeout' => null]);
         $resolver->setAllowedTypes('scheme', ['string']);
         $resolver->setAllowedTypes('host', ['string']);
-        $resolver->setAllowedTypes('port', ['int']);
+        $resolver->setAllowedTypes('port', []);
         $resolver->setAllowedTypes('user', ['string', 'null']);
         $resolver->setAllowedTypes('password', ['string', 'null']);
         $resolver->setAllowedTypes('database', ['string', 'null']);

51) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:94    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $resolver->setAllowedTypes('scheme', ['string']);
         $resolver->setAllowedTypes('host', ['string']);
         $resolver->setAllowedTypes('port', ['int']);
-        $resolver->setAllowedTypes('user', ['string', 'null']);
+        $resolver->setAllowedTypes('user', ['null']);
         $resolver->setAllowedTypes('password', ['string', 'null']);
         $resolver->setAllowedTypes('database', ['string', 'null']);
         $resolver->setAllowedValues('host', function ($host) use($configuration) : bool {

52) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:94    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $resolver->setAllowedTypes('scheme', ['string']);
         $resolver->setAllowedTypes('host', ['string']);
         $resolver->setAllowedTypes('port', ['int']);
-        $resolver->setAllowedTypes('user', ['string', 'null']);
+        
         $resolver->setAllowedTypes('password', ['string', 'null']);
         $resolver->setAllowedTypes('database', ['string', 'null']);
         $resolver->setAllowedValues('host', function ($host) use($configuration) : bool {

53) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:95    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $resolver->setAllowedTypes('host', ['string']);
         $resolver->setAllowedTypes('port', ['int']);
         $resolver->setAllowedTypes('user', ['string', 'null']);
-        $resolver->setAllowedTypes('password', ['string', 'null']);
+        $resolver->setAllowedTypes('password', ['null']);
         $resolver->setAllowedTypes('database', ['string', 'null']);
         $resolver->setAllowedValues('host', function ($host) use($configuration) : bool {
             if (null !== $host) {

54) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:95    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $resolver->setAllowedTypes('host', ['string']);
         $resolver->setAllowedTypes('port', ['int']);
         $resolver->setAllowedTypes('user', ['string', 'null']);
-        $resolver->setAllowedTypes('password', ['string', 'null']);
+        
         $resolver->setAllowedTypes('database', ['string', 'null']);
         $resolver->setAllowedValues('host', function ($host) use($configuration) : bool {
             if (null !== $host) {

55) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:96    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $resolver->setAllowedTypes('port', ['int']);
         $resolver->setAllowedTypes('user', ['string', 'null']);
         $resolver->setAllowedTypes('password', ['string', 'null']);
-        $resolver->setAllowedTypes('database', ['string', 'null']);
+        $resolver->setAllowedTypes('database', ['null']);
         $resolver->setAllowedValues('host', function ($host) use($configuration) : bool {
             if (null !== $host) {
                 return true;

56) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:96    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $resolver->setAllowedTypes('port', ['int']);
         $resolver->setAllowedTypes('user', ['string', 'null']);
         $resolver->setAllowedTypes('password', ['string', 'null']);
-        $resolver->setAllowedTypes('database', ['string', 'null']);
+        
         $resolver->setAllowedValues('host', function ($host) use($configuration) : bool {
             if (null !== $host) {
                 return true;

58) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:99    [M] NotIdentical

--- Original
+++ New
@@ @@
         $resolver->setAllowedTypes('password', ['string', 'null']);
         $resolver->setAllowedTypes('database', ['string', 'null']);
         $resolver->setAllowedValues('host', function ($host) use($configuration) : bool {
-            if (null !== $host) {
+            if (null === $host) {
                 return true;
             }
             if (false !== getenv('EDGEDB_HOST')) {

59) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:100    [M] TrueValue

--- Original
+++ New
@@ @@
         $resolver->setAllowedTypes('database', ['string', 'null']);
         $resolver->setAllowedValues('host', function ($host) use($configuration) : bool {
             if (null !== $host) {
-                return true;
+                return false;
             }
             if (false !== getenv('EDGEDB_HOST')) {
                 return true;

60) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:103    [M] NotIdentical

--- Original
+++ New
@@ @@
             if (null !== $host) {
                 return true;
             }
-            if (false !== getenv('EDGEDB_HOST')) {
+            if (false === getenv('EDGEDB_HOST')) {
                 return true;
             }
             if (null !== $configuration['host']) {

61) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:103    [M] FalseValue

--- Original
+++ New
@@ @@
             if (null !== $host) {
                 return true;
             }
-            if (false !== getenv('EDGEDB_HOST')) {
+            if (true !== getenv('EDGEDB_HOST')) {
                 return true;
             }
             if (null !== $configuration['host']) {

62) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:104    [M] TrueValue

--- Original
+++ New
@@ @@
                 return true;
             }
             if (false !== getenv('EDGEDB_HOST')) {
-                return true;
+                return false;
             }
             if (null !== $configuration['host']) {
                 return true;

63) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:107    [M] NotIdentical

--- Original
+++ New
@@ @@
             if (false !== getenv('EDGEDB_HOST')) {
                 return true;
             }
-            if (null !== $configuration['host']) {
+            if (null === $configuration['host']) {
                 return true;
             }
             return false;

64) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:108    [M] TrueValue

--- Original
+++ New
@@ @@
                 return true;
             }
             if (null !== $configuration['host']) {
-                return true;
+                return false;
             }
             return false;
         });

67) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:115    [M] NotIdentical

--- Original
+++ New
@@ @@
             return false;
         });
         $resolver->setAllowedValues('port', function ($port) use($configuration) : bool {
-            if (null !== $port) {
+            if (null === $port) {
                 return true;
             }
             if (false !== getenv('EDGEDB_PORT')) {

68) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:116    [M] TrueValue

--- Original
+++ New
@@ @@
         });
         $resolver->setAllowedValues('port', function ($port) use($configuration) : bool {
             if (null !== $port) {
-                return true;
+                return false;
             }
             if (false !== getenv('EDGEDB_PORT')) {
                 return true;

69) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:119    [M] NotIdentical

--- Original
+++ New
@@ @@
             if (null !== $port) {
                 return true;
             }
-            if (false !== getenv('EDGEDB_PORT')) {
+            if (false === getenv('EDGEDB_PORT')) {
                 return true;
             }
             if (null !== $configuration['port']) {

70) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:119    [M] FalseValue

--- Original
+++ New
@@ @@
             if (null !== $port) {
                 return true;
             }
-            if (false !== getenv('EDGEDB_PORT')) {
+            if (true !== getenv('EDGEDB_PORT')) {
                 return true;
             }
             if (null !== $configuration['port']) {

71) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:120    [M] TrueValue

--- Original
+++ New
@@ @@
                 return true;
             }
             if (false !== getenv('EDGEDB_PORT')) {
-                return true;
+                return false;
             }
             if (null !== $configuration['port']) {
                 return true;

72) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:123    [M] NotIdentical

--- Original
+++ New
@@ @@
             if (false !== getenv('EDGEDB_PORT')) {
                 return true;
             }
-            if (null !== $configuration['port']) {
+            if (null === $configuration['port']) {
                 return true;
             }
             return false;

73) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:124    [M] TrueValue

--- Original
+++ New
@@ @@
                 return true;
             }
             if (null !== $configuration['port']) {
-                return true;
+                return false;
             }
             return false;
         });

76) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:131    [M] NotIdentical

--- Original
+++ New
@@ @@
             return false;
         });
         $resolver->setAllowedValues('user', function ($user) use($configuration) : bool {
-            if (null !== $user) {
+            if (null === $user) {
                 return true;
             }
             if (false !== getenv('EDGEDB_USER')) {

77) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:132    [M] TrueValue

--- Original
+++ New
@@ @@
         });
         $resolver->setAllowedValues('user', function ($user) use($configuration) : bool {
             if (null !== $user) {
-                return true;
+                return false;
             }
             if (false !== getenv('EDGEDB_USER')) {
                 return true;

78) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:135    [M] FalseValue

--- Original
+++ New
@@ @@
             if (null !== $user) {
                 return true;
             }
-            if (false !== getenv('EDGEDB_USER')) {
+            if (true !== getenv('EDGEDB_USER')) {
                 return true;
             }
             if (null !== $configuration['user']) {

79) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:135    [M] NotIdentical

--- Original
+++ New
@@ @@
             if (null !== $user) {
                 return true;
             }
-            if (false !== getenv('EDGEDB_USER')) {
+            if (false === getenv('EDGEDB_USER')) {
                 return true;
             }
             if (null !== $configuration['user']) {

80) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:136    [M] TrueValue

--- Original
+++ New
@@ @@
                 return true;
             }
             if (false !== getenv('EDGEDB_USER')) {
-                return true;
+                return false;
             }
             if (null !== $configuration['user']) {
                 return true;

81) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:139    [M] NotIdentical

--- Original
+++ New
@@ @@
             if (false !== getenv('EDGEDB_USER')) {
                 return true;
             }
-            if (null !== $configuration['user']) {
+            if (null === $configuration['user']) {
                 return true;
             }
             return false;

82) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:140    [M] TrueValue

--- Original
+++ New
@@ @@
                 return true;
             }
             if (null !== $configuration['user']) {
-                return true;
+                return false;
             }
             return false;
         });

85) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:147    [M] NotIdentical

--- Original
+++ New
@@ @@
             return false;
         });
         $resolver->setAllowedValues('database', function ($database) use($configuration) : bool {
-            if (null !== $database) {
+            if (null === $database) {
                 return true;
             }
             if (false !== getenv('EDGEDB_DATABASE')) {

86) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:148    [M] TrueValue

--- Original
+++ New
@@ @@
         });
         $resolver->setAllowedValues('database', function ($database) use($configuration) : bool {
             if (null !== $database) {
-                return true;
+                return false;
             }
             if (false !== getenv('EDGEDB_DATABASE')) {
                 return true;

87) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:151    [M] NotIdentical

--- Original
+++ New
@@ @@
             if (null !== $database) {
                 return true;
             }
-            if (false !== getenv('EDGEDB_DATABASE')) {
+            if (false === getenv('EDGEDB_DATABASE')) {
                 return true;
             }
             if (null !== $configuration['database']) {

88) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:151    [M] FalseValue

--- Original
+++ New
@@ @@
             if (null !== $database) {
                 return true;
             }
-            if (false !== getenv('EDGEDB_DATABASE')) {
+            if (true !== getenv('EDGEDB_DATABASE')) {
                 return true;
             }
             if (null !== $configuration['database']) {

89) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:152    [M] TrueValue

--- Original
+++ New
@@ @@
                 return true;
             }
             if (false !== getenv('EDGEDB_DATABASE')) {
-                return true;
+                return false;
             }
             if (null !== $configuration['database']) {
                 return true;

90) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:155    [M] NotIdentical

--- Original
+++ New
@@ @@
             if (false !== getenv('EDGEDB_DATABASE')) {
                 return true;
             }
-            if (null !== $configuration['database']) {
+            if (null === $configuration['database']) {
                 return true;
             }
             return false;

91) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:156    [M] TrueValue

--- Original
+++ New
@@ @@
                 return true;
             }
             if (null !== $configuration['database']) {
-                return true;
+                return false;
             }
             return false;
         });

94) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:163    [M] Identical

--- Original
+++ New
@@ @@
             return false;
         });
         $resolver->setAllowedValues('password', function ($password) use($configuration) : bool {
-            if (null === $password) {
+            if (null !== $password) {
                 return true;
             }
             if (false !== getenv('EDGEDB_PASSWORD')) {

95) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:164    [M] TrueValue

--- Original
+++ New
@@ @@
         });
         $resolver->setAllowedValues('password', function ($password) use($configuration) : bool {
             if (null === $password) {
-                return true;
+                return false;
             }
             if (false !== getenv('EDGEDB_PASSWORD')) {
                 return true;

96) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:167    [M] FalseValue

--- Original
+++ New
@@ @@
             if (null === $password) {
                 return true;
             }
-            if (false !== getenv('EDGEDB_PASSWORD')) {
+            if (true !== getenv('EDGEDB_PASSWORD')) {
                 return true;
             }
             if (null !== $configuration['password']) {

97) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:167    [M] NotIdentical

--- Original
+++ New
@@ @@
             if (null === $password) {
                 return true;
             }
-            if (false !== getenv('EDGEDB_PASSWORD')) {
+            if (false === getenv('EDGEDB_PASSWORD')) {
                 return true;
             }
             if (null !== $configuration['password']) {

98) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:168    [M] TrueValue

--- Original
+++ New
@@ @@
                 return true;
             }
             if (false !== getenv('EDGEDB_PASSWORD')) {
-                return true;
+                return false;
             }
             if (null !== $configuration['password']) {
                 return true;

99) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:171    [M] NotIdentical

--- Original
+++ New
@@ @@
             if (false !== getenv('EDGEDB_PASSWORD')) {
                 return true;
             }
-            if (null !== $configuration['password']) {
+            if (null === $configuration['password']) {
                 return true;
             }
             return false;

100) /Users/guillaume/Projects/edgedb-php/src/Protocol/BlockingClient.php:172    [M] TrueValue

--- Original
+++ New
@@ @@
                 return true;
             }
             if (null !== $configuration['password']) {
-                return true;
+                return false;
             }
             return false;
         });

102) /Users/guillaume/Projects/edgedb-php/src/Protocol/Connection.php:12    [M] PublicVisibility

--- Original
+++ New
@@ @@
  */
 final class Connection
 {
-    public function connect()
+    protected function connect()
     {
     }
     public function query(string $query, array $arguments)

103) /Users/guillaume/Projects/edgedb-php/src/Protocol/Connection.php:17    [M] PublicVisibility

--- Original
+++ New
@@ @@
     public function connect()
     {
     }
-    public function query(string $query, array $arguments)
+    protected function query(string $query, array $arguments)
     {
     }
     public function queryOne(string $query, array $arguments)

104) /Users/guillaume/Projects/edgedb-php/src/Protocol/Connection.php:22    [M] PublicVisibility

--- Original
+++ New
@@ @@
     public function query(string $query, array $arguments)
     {
     }
-    public function queryOne(string $query, array $arguments)
+    protected function queryOne(string $query, array $arguments)
     {
     }
     public function queryJson(string $query, array $arguments)

105) /Users/guillaume/Projects/edgedb-php/src/Protocol/Connection.php:27    [M] PublicVisibility

--- Original
+++ New
@@ @@
     public function queryOne(string $query, array $arguments)
     {
     }
-    public function queryJson(string $query, array $arguments)
+    protected function queryJson(string $query, array $arguments)
     {
     }
     public function queryJsonOne(string $query, array $arguments)

106) /Users/guillaume/Projects/edgedb-php/src/Protocol/Connection.php:32    [M] PublicVisibility

--- Original
+++ New
@@ @@
     public function queryJson(string $query, array $arguments)
     {
     }
-    public function queryJsonOne(string $query, array $arguments)
+    protected function queryJsonOne(string $query, array $arguments)
     {
     }
     public function execute(string $query)

107) /Users/guillaume/Projects/edgedb-php/src/Protocol/Connection.php:37    [M] PublicVisibility

--- Original
+++ New
@@ @@
     public function queryJsonOne(string $query, array $arguments)
     {
     }
-    public function execute(string $query)
+    protected function execute(string $query)
     {
     }
     public function transaction(bool $isolated, bool $readOnly, bool $deferrable) : Transaction

108) /Users/guillaume/Projects/edgedb-php/src/Protocol/Connection.php:42    [M] PublicVisibility

--- Original
+++ New
@@ @@
     public function execute(string $query)
     {
     }
-    public function transaction(bool $isolated, bool $readOnly, bool $deferrable) : Transaction
+    protected function transaction(bool $isolated, bool $readOnly, bool $deferrable) : Transaction
     {
     }
 }

109) /Users/guillaume/Projects/edgedb-php/src/Protocol/ConnectionPool.php:20    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @var Connection[]
      */
     private $connections;
-    public function add(Connection $connection) : void
+    protected function add(Connection $connection) : void
     {
         $this->connections[] = $connection;
     }

110) /Users/guillaume/Projects/edgedb-php/src/Protocol/Credentials.php:73    [M] Throw_

--- Original
+++ New
@@ @@
             throw new RuntimeException('The port is not valid');
         }
         if (array_key_exists('host', $credentials) && !is_string($credentials['host'])) {
-            throw new RuntimeException('The host is not valid');
+            new RuntimeException('The host is not valid');
         }
         if (array_key_exists('database', $credentials) && !is_string($credentials['database'])) {
             throw new RuntimeException('The database is not valid');

111) /Users/guillaume/Projects/edgedb-php/src/Protocol/Credentials.php:77    [M] Throw_

--- Original
+++ New
@@ @@
             throw new RuntimeException('The host is not valid');
         }
         if (array_key_exists('database', $credentials) && !is_string($credentials['database'])) {
-            throw new RuntimeException('The database is not valid');
+            new RuntimeException('The database is not valid');
         }
         if (array_key_exists('user', $credentials) && !is_string($credentials['user'])) {
             throw new RuntimeException('The user is not valid');

112) /Users/guillaume/Projects/edgedb-php/src/Protocol/Credentials.php:81    [M] Throw_

--- Original
+++ New
@@ @@
             throw new RuntimeException('The database is not valid');
         }
         if (array_key_exists('user', $credentials) && !is_string($credentials['user'])) {
-            throw new RuntimeException('The user is not valid');
+            new RuntimeException('The user is not valid');
         }
         if (array_key_exists('password', $credentials) && !is_string($credentials['password'])) {
             throw new RuntimeException('The password is not valid');

113) /Users/guillaume/Projects/edgedb-php/src/Protocol/Credentials.php:85    [M] Throw_

--- Original
+++ New
@@ @@
             throw new RuntimeException('The user is not valid');
         }
         if (array_key_exists('password', $credentials) && !is_string($credentials['password'])) {
-            throw new RuntimeException('The password is not valid');
+            new RuntimeException('The password is not valid');
         }
         return $credentials;
     }
 }

114) /Users/guillaume/Projects/edgedb-php/src/Protocol/ReadBuffer.php:21    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     public function __construct(Buffer $buffer)
     {
         $this->buffer = $buffer;
-        $this->position = 0;
+        $this->position = 1;
     }
     public static function init(ReadBuffer $readBuffer, Buffer $buffer) : void
     {

115) /Users/guillaume/Projects/edgedb-php/src/Protocol/ReadBuffer.php:21    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function __construct(Buffer $buffer)
     {
         $this->buffer = $buffer;
-        $this->position = 0;
+        $this->position = -1;
     }
     public static function init(ReadBuffer $readBuffer, Buffer $buffer) : void
     {

116) /Users/guillaume/Projects/edgedb-php/src/Protocol/ReadBuffer.php:24    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->buffer = $buffer;
         $this->position = 0;
     }
-    public static function init(ReadBuffer $readBuffer, Buffer $buffer) : void
+    protected static function init(ReadBuffer $readBuffer, Buffer $buffer) : void
     {
         $readBuffer->buffer = $buffer;
         $readBuffer->position = 0;

117) /Users/guillaume/Projects/edgedb-php/src/Protocol/ReadBuffer.php:27    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     public static function init(ReadBuffer $readBuffer, Buffer $buffer) : void
     {
         $readBuffer->buffer = $buffer;
-        $readBuffer->position = 0;
+        $readBuffer->position = 1;
         // TODO
     }
     public function finish() : void

118) /Users/guillaume/Projects/edgedb-php/src/Protocol/ReadBuffer.php:27    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public static function init(ReadBuffer $readBuffer, Buffer $buffer) : void
     {
         $readBuffer->buffer = $buffer;
-        $readBuffer->position = 0;
+        $readBuffer->position = -1;
         // TODO
     }
     public function finish() : void

119) /Users/guillaume/Projects/edgedb-php/src/Protocol/ReadBuffer.php:31    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $readBuffer->position = 0;
         // TODO
     }
-    public function finish() : void
+    protected function finish() : void
     {
         if ($this->length !== $this->position) {
             throw new BufferError('Unexpected trailing data in buffer');

120) /Users/guillaume/Projects/edgedb-php/src/Protocol/ReadBuffer.php:33    [M] NotIdentical

--- Original
+++ New
@@ @@
     }
     public function finish() : void
     {
-        if ($this->length !== $this->position) {
+        if ($this->length === $this->position) {
             throw new BufferError('Unexpected trailing data in buffer');
         }
     }

121) /Users/guillaume/Projects/edgedb-php/src/Protocol/ReadBuffer.php:34    [M] Throw_

--- Original
+++ New
@@ @@
     public function finish() : void
     {
         if ($this->length !== $this->position) {
-            throw new BufferError('Unexpected trailing data in buffer');
+            new BufferError('Unexpected trailing data in buffer');
         }
     }
     public function discard(int $size) : void

122) /Users/guillaume/Projects/edgedb-php/src/Protocol/ReadBuffer.php:38    [M] PublicVisibility

--- Original
+++ New
@@ @@
             throw new BufferError('Unexpected trailing data in buffer');
         }
     }
-    public function discard(int $size) : void
+    protected function discard(int $size) : void
     {
         if ($this->position + $size > $this->length) {
             throw new BufferError('Buffer overread');

123) /Users/guillaume/Projects/edgedb-php/src/Protocol/ReadBuffer.php:40    [M] GreaterThan

--- Original
+++ New
@@ @@
     }
     public function discard(int $size) : void
     {
-        if ($this->position + $size > $this->length) {
+        if ($this->position + $size >= $this->length) {
             throw new BufferError('Buffer overread');
         }
         $this->position += $size;

124) /Users/guillaume/Projects/edgedb-php/src/Protocol/ReadBuffer.php:40    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
     }
     public function discard(int $size) : void
     {
-        if ($this->position + $size > $this->length) {
+        if ($this->position + $size <= $this->length) {
             throw new BufferError('Buffer overread');
         }
         $this->position += $size;

125) /Users/guillaume/Projects/edgedb-php/src/Protocol/ReadBuffer.php:40    [M] Plus

--- Original
+++ New
@@ @@
     }
     public function discard(int $size) : void
     {
-        if ($this->position + $size > $this->length) {
+        if ($this->position - $size > $this->length) {
             throw new BufferError('Buffer overread');
         }
         $this->position += $size;

126) /Users/guillaume/Projects/edgedb-php/src/Protocol/ReadBuffer.php:41    [M] Throw_

--- Original
+++ New
@@ @@
     public function discard(int $size) : void
     {
         if ($this->position + $size > $this->length) {
-            throw new BufferError('Buffer overread');
+            new BufferError('Buffer overread');
         }
         $this->position += $size;
     }

127) /Users/guillaume/Projects/edgedb-php/src/Protocol/ReadBuffer.php:44    [M] Assignment

--- Original
+++ New
@@ @@
         if ($this->position + $size > $this->length) {
             throw new BufferError('Buffer overread');
         }
-        $this->position += $size;
+        $this->position = $size;
     }
     public function getPosition() : int
     {

128) /Users/guillaume/Projects/edgedb-php/src/Protocol/ReadBuffer.php:44    [M] PlusEqual

--- Original
+++ New
@@ @@
         if ($this->position + $size > $this->length) {
             throw new BufferError('Buffer overread');
         }
-        $this->position += $size;
+        $this->position -= $size;
     }
     public function getPosition() : int
     {
