129) /Users/guillaume/Projects/edgedb-php/src/Protocol/ReadBuffer.php:47    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         $this->position += $size;
     }
-    public function getPosition() : int
+    protected function getPosition() : int
     {
         return $this->position;
     }

130) /Users/guillaume/Projects/edgedb-php/src/Protocol/ReadBuffer.php:52    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->position;
     }
-    public function getLength() : int
+    protected function getLength() : int
     {
         return $this->length;
     }
 }

131) /Users/guillaume/Projects/edgedb-php/src/Protocol/Transaction.php:12    [M] PublicVisibility

--- Original
+++ New
@@ @@
  */
 final class Transaction
 {
-    public function start()
+    protected function start()
     {
     }
     public function commit()

132) /Users/guillaume/Projects/edgedb-php/src/Protocol/Transaction.php:17    [M] PublicVisibility

--- Original
+++ New
@@ @@
     public function start()
     {
     }
-    public function commit()
+    protected function commit()
     {
     }
     public function rollback()

133) /Users/guillaume/Projects/edgedb-php/src/Protocol/Transaction.php:22    [M] PublicVisibility

--- Original
+++ New
@@ @@
     public function commit()
     {
     }
-    public function rollback()
+    protected function rollback()
     {
     }
 }

134) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteBuffer.php:28    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->position = 0;
     }
-    public function writeString(string $string) : self
+    protected function writeString(string $string) : self
     {
     }
     public function writeInt32(int $number) : self

135) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteBuffer.php:33    [M] PublicVisibility

--- Original
+++ New
@@ @@
     public function writeString(string $string) : self
     {
     }
-    public function writeInt32(int $number) : self
+    protected function writeInt32(int $number) : self
     {
         $this->ensureAllocated(4);
         // TODO

136) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteBuffer.php:35    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     public function writeInt32(int $number) : self
     {
-        $this->ensureAllocated(4);
+        $this->ensureAllocated(5);
         // TODO
         $this->position = +4;
         return $this;

137) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteBuffer.php:35    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function writeInt32(int $number) : self
     {
-        $this->ensureAllocated(4);
+        
         // TODO
         $this->position = +4;
         return $this;

138) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteBuffer.php:35    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public function writeInt32(int $number) : self
     {
-        $this->ensureAllocated(4);
+        $this->ensureAllocated(3);
         // TODO
         $this->position = +4;
         return $this;

139) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteBuffer.php:39    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $this->ensureAllocated(4);
         // TODO
-        $this->position = +4;
+        $this->position = +5;
         return $this;
     }
     public function unwrap() : Buffer

140) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteBuffer.php:39    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $this->ensureAllocated(4);
         // TODO
-        $this->position = +4;
+        $this->position = +3;
         return $this;
     }
     public function unwrap() : Buffer

141) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteBuffer.php:44    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->position = +4;
         return $this;
     }
-    public function unwrap() : Buffer
+    protected function unwrap() : Buffer
     {
     }
     public function getPosition() : int

142) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteBuffer.php:56    [M] Plus

--- Original
+++ New
@@ @@
     }
     private function ensureAllocated(int $extraLength) : void
     {
-        $newSize = $this->position + $extraLength;
+        $newSize = $this->position - $extraLength;
         if ($newSize > $this->size) {
             $this->reAllocate($newSize);
         }

143) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteBuffer.php:57    [M] GreaterThan

--- Original
+++ New
@@ @@
     private function ensureAllocated(int $extraLength) : void
     {
         $newSize = $this->position + $extraLength;
-        if ($newSize > $this->size) {
+        if ($newSize >= $this->size) {
             $this->reAllocate($newSize);
         }
     }

144) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteBuffer.php:57    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
     private function ensureAllocated(int $extraLength) : void
     {
         $newSize = $this->position + $extraLength;
-        if ($newSize > $this->size) {
+        if ($newSize <= $this->size) {
             $this->reAllocate($newSize);
         }
     }

145) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteBuffer.php:58    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $newSize = $this->position + $extraLength;
         if ($newSize > $this->size) {
-            $this->reAllocate($newSize);
+            
         }
     }
     private function reAllocate(int $newSize) : void

146) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:20    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function __construct()
     {
         $this->buffer = new WriteBuffer();
-        $this->messagePosition = -1;
+        $this->messagePosition = -2;
     }
     public function reset() : self
     {

147) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:20    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     public function __construct()
     {
         $this->buffer = new WriteBuffer();
-        $this->messagePosition = -1;
+        $this->messagePosition = -0;
     }
     public function reset() : self
     {

148) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:23    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->buffer = new WriteBuffer();
         $this->messagePosition = -1;
     }
-    public function reset() : self
+    protected function reset() : self
     {
         $this->messagePosition = -1;
         $this->buffer->reset();

149) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:25    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     }
     public function reset() : self
     {
-        $this->messagePosition = -1;
+        $this->messagePosition = -0;
         $this->buffer->reset();
         return $this;
     }

150) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:25    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     public function reset() : self
     {
-        $this->messagePosition = -1;
+        $this->messagePosition = -2;
         $this->buffer->reset();
         return $this;
     }

151) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:26    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function reset() : self
     {
         $this->messagePosition = -1;
-        $this->buffer->reset();
+        
         return $this;
     }
     public function beginMessage(string $value) : self

152) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:31    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->buffer->reset();
         return $this;
     }
-    public function beginMessage(string $value) : self
+    protected function beginMessage(string $value) : self
     {
         if ($this->messagePosition >= 0) {
             throw new BufferError('The previous message is not finished');

153) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:33    [M] GreaterThanOrEqualToNegotiation

--- Original
+++ New
@@ @@
     }
     public function beginMessage(string $value) : self
     {
-        if ($this->messagePosition >= 0) {
+        if ($this->messagePosition < 0) {
             throw new BufferError('The previous message is not finished');
         }
         $this->messagePosition = $this->buffer->getPosition();

154) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:33    [M] GreaterThanOrEqualTo

--- Original
+++ New
@@ @@
     }
     public function beginMessage(string $value) : self
     {
-        if ($this->messagePosition >= 0) {
+        if ($this->messagePosition > 0) {
             throw new BufferError('The previous message is not finished');
         }
         $this->messagePosition = $this->buffer->getPosition();

155) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:34    [M] Throw_

--- Original
+++ New
@@ @@
     public function beginMessage(string $value) : self
     {
         if ($this->messagePosition >= 0) {
-            throw new BufferError('The previous message is not finished');
+            new BufferError('The previous message is not finished');
         }
         $this->messagePosition = $this->buffer->getPosition();
         $this->buffer->writeChar($value);

156) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:38    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             throw new BufferError('The previous message is not finished');
         }
         $this->messagePosition = $this->buffer->getPosition();
-        $this->buffer->writeChar($value);
+        
         $this->buffer->writeInt32(0);
         return $this;
     }

157) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:39    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         }
         $this->messagePosition = $this->buffer->getPosition();
         $this->buffer->writeChar($value);
-        $this->buffer->writeInt32(0);
+        $this->buffer->writeInt32(1);
         return $this;
     }
     public function endMessage() : self

158) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:39    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         $this->messagePosition = $this->buffer->getPosition();
         $this->buffer->writeChar($value);
-        $this->buffer->writeInt32(0);
+        
         return $this;
     }
     public function endMessage() : self

159) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:39    [M] DecrementInteger

--- Original
+++ New
@@ @@
         }
         $this->messagePosition = $this->buffer->getPosition();
         $this->buffer->writeChar($value);
-        $this->buffer->writeInt32(0);
+        $this->buffer->writeInt32(-1);
         return $this;
     }
     public function endMessage() : self

160) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:44    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->buffer->writeInt32(0);
         return $this;
     }
-    public function endMessage() : self
+    protected function endMessage() : self
     {
         if ($this->messagePosition < 0) {
             throw new BufferError('No current message');

161) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:46    [M] LessThan

--- Original
+++ New
@@ @@
     }
     public function endMessage() : self
     {
-        if ($this->messagePosition < 0) {
+        if ($this->messagePosition <= 0) {
             throw new BufferError('No current message');
         }
         // TODO

162) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:46    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
     }
     public function endMessage() : self
     {
-        if ($this->messagePosition < 0) {
+        if ($this->messagePosition >= 0) {
             throw new BufferError('No current message');
         }
         // TODO

163) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:47    [M] Throw_

--- Original
+++ New
@@ @@
     public function endMessage() : self
     {
         if ($this->messagePosition < 0) {
-            throw new BufferError('No current message');
+            new BufferError('No current message');
         }
         // TODO
         $this->messagePosition = -1;

164) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:52    [M] IncrementInteger

--- Original
+++ New
@@ @@
             throw new BufferError('No current message');
         }
         // TODO
-        $this->messagePosition = -1;
+        $this->messagePosition = -2;
         return $this;
     }
     public function writeChar(string $char) : self

165) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:52    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             throw new BufferError('No current message');
         }
         // TODO
-        $this->messagePosition = -1;
+        $this->messagePosition = -0;
         return $this;
     }
     public function writeChar(string $char) : self

166) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:57    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->messagePosition = -1;
         return $this;
     }
-    public function writeChar(string $char) : self
+    protected function writeChar(string $char) : self
     {
         if ($this->messagePosition > 0) {
             throw new BufferError('No current message');

167) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:59    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
     }
     public function writeChar(string $char) : self
     {
-        if ($this->messagePosition > 0) {
+        if ($this->messagePosition <= 0) {
             throw new BufferError('No current message');
         }
         $this->buffer->writeChar($char);

168) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:59    [M] GreaterThan

--- Original
+++ New
@@ @@
     }
     public function writeChar(string $char) : self
     {
-        if ($this->messagePosition > 0) {
+        if ($this->messagePosition >= 0) {
             throw new BufferError('No current message');
         }
         $this->buffer->writeChar($char);

169) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:60    [M] Throw_

--- Original
+++ New
@@ @@
     public function writeChar(string $char) : self
     {
         if ($this->messagePosition > 0) {
-            throw new BufferError('No current message');
+            new BufferError('No current message');
         }
         $this->buffer->writeChar($char);
         return $this;

170) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:63    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if ($this->messagePosition > 0) {
             throw new BufferError('No current message');
         }
-        $this->buffer->writeChar($char);
+        
         return $this;
     }
     public function writeFlush() : self

171) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:68    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->buffer->writeChar($char);
         return $this;
     }
-    public function writeFlush() : self
+    protected function writeFlush() : self
     {
         if ($this->messagePosition >= 0) {
             throw new BufferError('The previous message is not finished');

175) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:74    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if ($this->messagePosition >= 0) {
             throw new BufferError('The previous message is not finished');
         }
-        $this->buffer->writeMessage();
+        
         return $this;
     }
     public function unwrap() : Buffer

179) /Users/guillaume/Projects/edgedb-php/src/Protocol/WriteMessageBuffer.php:82    [M] Throw_

--- Original
+++ New
@@ @@
     public function unwrap() : Buffer
     {
         if ($this->messagePosition >= 0) {
-            throw new BufferError('An unfinished message is in the buffer');
+            new BufferError('An unfinished message is in the buffer');
         }
         return $this->buffer->unwrap();
     }
 }

180) /Users/guillaume/Projects/edgedb-php/src/Query/EdgeQLHttpResult.php:36    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->data = $data;
         $this->error = $error;
     }
-    public function filter(Closure $filter) : self
+    protected function filter(Closure $filter) : self
     {
         return new self(array_filter($this->data, $filter, ARRAY_FILTER_USE_BOTH), $this->error);
     }

181) /Users/guillaume/Projects/edgedb-php/src/Query/EdgeQLHttpResult.php:38    [M] UnwrapArrayFilter

--- Original
+++ New
@@ @@
     }
     public function filter(Closure $filter) : self
     {
-        return new self(array_filter($this->data, $filter, ARRAY_FILTER_USE_BOTH), $this->error);
+        return new self($this->data, $this->error);
     }
     public function getData() : array
     {

182) /Users/guillaume/Projects/edgedb-php/src/Query/EdgeQLHttpResult.php:41    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return new self(array_filter($this->data, $filter, ARRAY_FILTER_USE_BOTH), $this->error);
     }
-    public function getData() : array
+    protected function getData() : array
     {
         return $this->data;
     }

183) /Users/guillaume/Projects/edgedb-php/src/Query/EdgeQLHttpResult.php:49    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return array<string, string|int>|null
      */
-    public function getError() : ?array
+    protected function getError() : ?array
     {
         return $this->error;
     }
 }
