1) /Users/guillaume/Projects/edgedb-php/src/Protocol/Credentials.php:68    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     private function validateCredentials(array $credentials = [])
     {
-        $credentials['port'] = $credentials['port'] ?? 5656;
+        $credentials['port'] = $credentials['port'] ?? 5655;
         if (!is_int($credentials['port']) || ($credentials['port'] < 1 || $credentials['port'] > 65535)) {
             throw new RuntimeException('The port is not valid');
         }

2) /Users/guillaume/Projects/edgedb-php/src/Protocol/Credentials.php:68    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     private function validateCredentials(array $credentials = [])
     {
-        $credentials['port'] = $credentials['port'] ?? 5656;
+        $credentials['port'] = $credentials['port'] ?? 5657;
         if (!is_int($credentials['port']) || ($credentials['port'] < 1 || $credentials['port'] > 65535)) {
             throw new RuntimeException('The port is not valid');
         }

110) /Users/guillaume/Projects/edgedb-php/src/Protocol/Credentials.php:46    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $self->password = $credentials['password'];
         return $self;
     }
-    public function getPort() : int
+    protected function getPort() : int
     {
         return $this->port;
     }

111) /Users/guillaume/Projects/edgedb-php/src/Protocol/Credentials.php:51    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->port;
     }
-    public function getDatabase() : string
+    protected function getDatabase() : string
     {
         return $this->database;
     }

113) /Users/guillaume/Projects/edgedb-php/src/Protocol/Credentials.php:61    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->username;
     }
-    public function getPassword() : string
+    protected function getPassword() : string
     {
         return $this->password;
     }

115) /Users/guillaume/Projects/edgedb-php/src/Protocol/Credentials.php:74    [M] LogicalAnd

--- Original
+++ New
@@ @@
         if (!is_int($credentials['port']) || ($credentials['port'] < 1 || $credentials['port'] > 65535)) {
             throw new RuntimeException('The port is not valid');
         }
-        if (array_key_exists('host', $credentials) && !is_string($credentials['host'])) {
+        if (array_key_exists('host', $credentials) || !is_string($credentials['host'])) {
             throw new RuntimeException('The host is not valid');
         }
         if (array_key_exists('database', $credentials) && !is_string($credentials['database'])) {

117) /Users/guillaume/Projects/edgedb-php/src/Protocol/Credentials.php:78    [M] LogicalNot

--- Original
+++ New
@@ @@
         if (array_key_exists('host', $credentials) && !is_string($credentials['host'])) {
             throw new RuntimeException('The host is not valid');
         }
-        if (array_key_exists('database', $credentials) && !is_string($credentials['database'])) {
+        if (array_key_exists('database', $credentials) && is_string($credentials['database'])) {
             throw new RuntimeException('The database is not valid');
         }
         if (array_key_exists('user', $credentials) && !is_string($credentials['user'])) {

118) /Users/guillaume/Projects/edgedb-php/src/Protocol/Credentials.php:78    [M] LogicalAnd

--- Original
+++ New
@@ @@
         if (array_key_exists('host', $credentials) && !is_string($credentials['host'])) {
             throw new RuntimeException('The host is not valid');
         }
-        if (array_key_exists('database', $credentials) && !is_string($credentials['database'])) {
+        if (array_key_exists('database', $credentials) || !is_string($credentials['database'])) {
             throw new RuntimeException('The database is not valid');
         }
         if (array_key_exists('user', $credentials) && !is_string($credentials['user'])) {

120) /Users/guillaume/Projects/edgedb-php/src/Protocol/Credentials.php:82    [M] LogicalAnd

--- Original
+++ New
@@ @@
         if (array_key_exists('database', $credentials) && !is_string($credentials['database'])) {
             throw new RuntimeException('The database is not valid');
         }
-        if (array_key_exists('user', $credentials) && !is_string($credentials['user'])) {
+        if (array_key_exists('user', $credentials) || !is_string($credentials['user'])) {
             throw new RuntimeException('The user is not valid');
         }
         if (array_key_exists('password', $credentials) && !is_string($credentials['password'])) {

123) /Users/guillaume/Projects/edgedb-php/src/Protocol/Credentials.php:86    [M] LogicalNot

--- Original
+++ New
@@ @@
         if (array_key_exists('user', $credentials) && !is_string($credentials['user'])) {
             throw new RuntimeException('The user is not valid');
         }
-        if (array_key_exists('password', $credentials) && !is_string($credentials['password'])) {
+        if (array_key_exists('password', $credentials) && is_string($credentials['password'])) {
             throw new RuntimeException('The password is not valid');
         }
     }
 }

124) /Users/guillaume/Projects/edgedb-php/src/Protocol/Credentials.php:86    [M] LogicalAnd

--- Original
+++ New
@@ @@
         if (array_key_exists('user', $credentials) && !is_string($credentials['user'])) {
             throw new RuntimeException('The user is not valid');
         }
-        if (array_key_exists('password', $credentials) && !is_string($credentials['password'])) {
+        if (array_key_exists('password', $credentials) || !is_string($credentials['password'])) {
             throw new RuntimeException('The password is not valid');
         }
     }
 }
